Config/Documents/ВыбытиеНеоплаченныхПутевок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВыбытиеНеоплаченныхПутевок</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦМО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦМО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДИсточника</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДляАкта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОснованияДляАкта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОснованияДляАкта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоверенностьВидДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоверенности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоверенности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДенежногоДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДенежныхДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДенежныйДокумент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДенежныеДокументы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаСписания</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПричинаСписания</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/AccountingRegisters/ЖурналПроводокЕПСБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>ЖурналПроводокЕПСБУ</Name>
			<ChartOfAccounts>ChartOfAccounts.ЕПСБУ</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КПС</Name>
					<Comment>Классификационный признак счета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоКПС</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КЭК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоКЭК</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИФО</Name>
					<Comment>Источник финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЖурналОпераций</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Журналы</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КФО</Name>
					<Comment>Код финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНеУчитываетсяНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетНеУчитываемых</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЕНВД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетЕНВД</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетНДС</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияДт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияКт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМежотчетногоПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМежотчетногоПериода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Config/Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчетнаяГруппа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС22</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС22_122</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС5_105</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7_107</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/ВыбытиеНеоплаченныхПутевок/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ВыбытиеНеоплаченныхПутевок";
	КомандаПечати.Идентификатор  = "Накладная0510458_157н";
	КомандаПечати.Представление  = УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(
		НСтр("ru = 'Накладная на отпуск материальных ценностей на сторону'"), "0510458", "61н", "157н");
	КомандаПечати.Порядок        = 1;

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ВыбытиеНеоплаченныхПутевок";
	КомандаПечати.Идентификатор		= "Накладная0504205_103н";
	КомандаПечати.Представление		= УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(
		НСтр("ru = 'Накладная на отпуск материалов на сторону'"), "0504205", "52н", "103н", Истина);
	КомандаПечати.Порядок			= 2;
	КомандаПечати.ДополнительныеПараметры.Вставить("ПоСебестоимости", Ложь); 

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ВыбытиеНеоплаченныхПутевок";
	КомандаПечати.Идентификатор		= "Накладная0504205_52н";
	КомандаПечати.Представление		= УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(
		НСтр("ru = 'Накладная на отпуск материалов на сторону'"), "0504205", "52н", , Истина);
	КомандаПечати.Порядок			= 3;
	КомандаПечати.ДополнительныеПараметры.Вставить("ПоСебестоимости", Ложь); 
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ВыбытиеНеоплаченныхПутевок";
	КомандаПечати.Идентификатор		= "Накладная0315007";
	КомандаПечати.Представление		= НСтр("ru = '(устарела) Накладная на отпуск материалов на сторону (М-15)'");
	КомандаПечати.Порядок			= 99;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "Накладная0510458_157н");
	Если ПечатнаяФорма <> Неопределено Тогда
		ПечатнаяФорма.ТабличныйДокумент = УправлениеПечатьюБГУ.НапечататьНакладнуюНаОтпускМЗ0510458(МассивОбъектов, ОбъектыПечати);
		ПечатнаяФорма.СинонимМакета = УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(
			НСтр("ru = 'Накладная на отпуск материальных ценностей на сторону'"), "0510458", "61н", "157н");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"Накладная0504205_103н") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Накладная0504205_103н",
			"Накладная на отпуск материалов на сторону (ф.0504205) ред. 103н", 
			ПечатьНакладной0504205(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_Накладная0504205_103н"));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"Накладная0504205_52н") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Накладная0504205_52н",
			"Накладная на отпуск материалов на сторону (ф.0504205) ред. 52н", 
			ПечатьНакладной0504205(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_Накладная0504205"));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Накладная0315007") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"Накладная0315007",
			"Накладная на отпуск материалов на сторону",
			ПечатьНакладной0315007(МассивОбъектов, ОбъектыПечати,ПараметрыПечати));
	КонецЕсли;

КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом


// Добавить данные для печати накладной0510458.
// 
// Параметры:
//  ДанныеДляПечати - см. УправлениеПечатьюБГУ.ТаблицаШапкиДляПечатиНакладной0510458
//  МассивОбъектов - Массив из ДокументСсылка.ВыбытиеНеоплаченныхПутевок
Процедура ДобавитьДанныеДляПечатиНакладной0510458(ДанныеДляПечати, МассивОбъектов) Экспорт
	
	ДанныеОрганизацийПечати = УправлениеПечатьюБГУ.ОбщиеСведенияДокументовДляПечати(МассивОбъектов);
	ДанныеГруппНФА = УправлениеПечатьюБГУ.ГруппыОбъектовНФА();
	
	ЧастиЗапроса = Новый Массив;
	ЧастиЗапроса.Добавить(ТекстЗапросаШапкиДляПечатиНакладной0510458());
	ЧастиЗапроса.Добавить(ТекстЗапросаТаблицыМатериалыДляПечатиНакладной0510458());
	ЧастиЗапроса.Добавить(ТекстЗапросаДвиженияЗабалансДляПечатиНакладнойНаОтпуск0510458());
	Запрос = Новый Запрос;
	Запрос.Текст = СтрСоединить(ЧастиЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов()); 
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);

	ДвиженияДокументов = УправлениеМатериальнымиЗапасами.ДвиженияДокументов(МассивОбъектов);
	ДвиженияДокументов.Индексы.Добавить("Ссылка, НомерСтроки");
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаШапка = РезультатЗапроса[0].Выбрать();
	ТабличныеЧасти = РезультатЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТаблицаДвиженийЗаб = РезультатЗапроса[2].Выгрузить();
	
	ПараметрыРаспределенияДвиженийЗаб = УправлениеПечатьюБГУ.СопоставитьДвиженияСоСтрокамиТабличнойЧасти_Параметры();
	ПараметрыРаспределенияДвиженийЗаб.ИмяКолонкиКЭК           = "";
	ПараметрыРаспределенияДвиженийЗаб.ИмяКолонкиНоменклатура  = "Номенклатура";
	ПараметрыРаспределенияДвиженийЗаб.ИменаСуммируемыхКолонок = "Количество,Сумма,КоличествоОстаток,СуммаОстаток";
	ПараметрыРаспределенияДвиженийЗаб.СоответствиеКолонок.Вставить("НоменклатураСсылка", "ВидДенежногоДокумента");
	ПараметрыРаспределенияДвиженийЗаб.СоответствиеКолонок.Вставить("СчетУчета", "СчетУчета");
	ПараметрыРаспределенияДвиженийЗаб.СоответствиеКолонок.Вставить("Количество",         "Количество");
	ПараметрыРаспределенияДвиженийЗаб.СоответствиеКолонок.Вставить("ДопСубконто",        "ДенежныйДокумент");

	ПараметрыРаспределенияДвиженийЗаб.СоответствиеКолонокУпрощенное.Вставить("НоменклатураСсылка", "Номенклатура");
	ПараметрыРаспределенияДвиженийЗаб.СоответствиеКолонокУпрощенное.Вставить("ДопСубконто",        "ДенежныйДокумент");
	ПараметрыРаспределенияДвиженийЗаб.СоответствиеКолонокУпрощенное.Вставить("СчетУчета",          "СчетУчета");
	
	Пока ВыборкаШапка.Следующий() Цикл
		СтрокаШапки = ДанныеДляПечати.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаШапки, ВыборкаШапка);
		СтрокаШапки.Номер = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ВыборкаШапка.Ссылка, ВыборкаШапка.Номер);
		
		ДанныеОрганизации = ДанныеОрганизацийПечати.Получить(ВыборкаШапка.Ссылка);
		СтрокаШапки.НаименованиеОрганизации = ДанныеОрганизации.НаименованиеОрганизации;
		СтрокаШапки.НаименованиеОбособленногоПодразделения = ДанныеОрганизации.НаименованиеОбособленногоПодразделения;
		СтрокаШапки.Учредитель = ДанныеОрганизации.Учредитель;
		СтрокаШапки.БюджетНаименование = ДанныеОрганизации.БюджетНаименование;
		СтрокаШапки.КодРПБС = ДанныеОрганизации.КодРПБС;
		СтрокаШапки.КодРПБСПодр = ДанныеОрганизации.КодРПБСОбособленногоПодразделения;
		СтрокаШапки.ГлаваБК = ДанныеОрганизации.ГлаваБК;
		СтрокаШапки.ОКТМО = ДанныеОрганизации.ОКТМО;
		СтрокаШапки.ИННОрганизации = ДанныеОрганизации.ИНН;
		СтрокаШапки.КППОрганизации = ДанныеОрганизации.КПП;
		СтрокаШапки.НаименованиеСтруктурногоПодразделения = ДанныеОрганизации.СтруктурноеПодразделение;
		
		Если ЗначениеЗаполнено(ВыборкаШапка.УполномоченноеЛицо) Тогда
			ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность",
				ВыборкаШапка.УполномоченноеЛицо, ВыборкаШапка.Дата);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
			СтрокаШапки.УполномоченноеЛицоДолжность = ДанныеСотрудника.Должность;
			СтрокаШапки.УполномоченноеЛицоФИО = КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина);
			СтрокаШапки.УполномоченноеЛицоДатаПодписи = ВыборкаШапка.Дата;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыборкаШапка.СотрудникОтправитель) Тогда
			ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность, НаименованиеПолное, Код",
				ВыборкаШапка.СотрудникОтправитель, ВыборкаШапка.Дата);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
			СтрокаШапки.ЦМООтправитель = ДанныеСотрудника.НаименованиеПолное;
			СтрокаШапки.ОтпустилДолжность = ДанныеСотрудника.Должность;
			СтрокаШапки.ОтпустилФИО = КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина);
			СтрокаШапки.ОтпустилДатаПодписи = ВыборкаШапка.Дата;
			СтрокаШапки.УчетныйНомерОтправитель = ДанныеСотрудника.Код;
		КонецЕсли;
		
		СтрокаШапки.ОтветственныйДолжность = ДанныеОрганизации.ОтветственныйДолжность;
		СтрокаШапки.ОтветственныйФИО = КорреспондентыКлиентСервер.ФИО(ДанныеОрганизации.ОтветственныйФИО, Истина);
		СтрокаШапки.ОтветственныйТелефон = ДанныеОрганизации.ОтветственныйТелефон;
		СтрокаШапки.ОтветственныйЭлПочта = ДанныеОрганизации.ОтветственныйЭлПочта;
		
		Если ЗначениеЗаполнено(СтрокаШапки.ПолучилФИО) И СтрНайти(СтрокаШапки.ПолучилФИО, ".") = 0 Тогда
			СтрокаШапки.ПолучилФИО = КорреспондентыКлиентСервер.ФИО(СтрокаШапки.ПолучилФИО);
		КонецЕсли;
		
		ТабличныеЧасти.Сбросить();
		Если ТабличныеЧасти.НайтиСледующий(Новый Структура("Ссылка", ВыборкаШапка.Ссылка)) Тогда
			СтрокиДокумента = ТабличныеЧасти.Выбрать();
			ТаблицаДвиженийДокументаЗаб = ТаблицаДвиженийЗаб.Скопировать(Новый Структура("Ссылка", ВыборкаШапка.Ссылка));
			ПараметрыРаспределенияДвиженийЗаб.Организация = ВыборкаШапка.Организация;
			ПараметрыРаспределенияДвиженийЗаб.ИФО = ВыборкаШапка.ИФО;
			ПараметрыРаспределенияДвиженийЗаб.Дата = ВыборкаШапка.Дата;
			ПараметрыРаспределенияДвиженийЗаб.ВыборкаМатериалы = СтрокиДокумента;
			ПараметрыРаспределенияДвиженийЗаб.ТаблицаДвижений = ТаблицаДвиженийДокументаЗаб;
			УправлениеПечатьюБГУ.СопоставитьДвиженияСоСтрокамиТабличнойЧасти(ПараметрыРаспределенияДвиженийЗаб);
			СтрокиДокумента.Сбросить();
		Иначе
			СтрокиДокумента = Неопределено;
		КонецЕсли;
	
		СтрокиНФАПоГруппам = Новый Соответствие;
		ИспользуемыеГруппы = Новый ТаблицаЗначений;
		ИспользуемыеГруппы.Колонки.Добавить("Группа", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		ИспользуемыеГруппы.Колонки.Добавить("ПорядокСчета", Новый ОписаниеТипов("Строка"));
		
		Всего = 0;
		
		ДанныеТабличныхЧастейДокумента = Новый Массив;
		Пока СтрокиДокумента <> Неопределено И СтрокиДокумента.Следующий() Цикл
			
			ТекущаяГруппаНФА = ДанныеГруппНФА.Получить(СтрокиДокумента.СчетУчета);
			Если ТекущаяГруппаНФА <> Неопределено Тогда
				ГрупповойСчет = ТекущаяГруппаНФА.Группа;
			Иначе
				ГрупповойСчет = ПланыСчетов.ЕПСБУ.ПустаяСсылка();
			КонецЕсли;
			
			ГруппировочнаяСтрока = СтрокиНФАПоГруппам.Получить(ГрупповойСчет);
			Если ГруппировочнаяСтрока = Неопределено Тогда
				ЗаголовокТабличнойЧасти = УправлениеПечатьюБГУ.ЗаголовокТабличнойЧастиДляПечатиНакладной0510458();
				СтрокаИспользуемыхГрупп = ИспользуемыеГруппы.Добавить();
				СтрокаИспользуемыхГрупп.Группа = ГрупповойСчет;
				Если ТекущаяГруппаНФА <> Неопределено Тогда
					Если СтрДлина(ТекущаяГруппаНФА.Код) > 4 Тогда
						ЗаголовокТабличнойЧасти.КодГруппыНФА = Сред(ТекущаяГруппаНФА.Код, 5);
					Иначе
						ЗаголовокТабличнойЧасти.КодГруппыНФА = ТекущаяГруппаНФА.Код;
					КонецЕсли;
					ЗаголовокТабличнойЧасти.ГруппаНФА    = ТекущаяГруппаНФА.Наименование;
					СтрокаИспользуемыхГрупп.ПорядокСчета = ТекущаяГруппаНФА.Порядок;
				КонецЕсли;
				СоставТабличнойЧасти = ЗаголовокТабличнойЧасти.Состав;
				СтрокиНФАПоГруппам.Вставить(ГрупповойСчет, ЗаголовокТабличнойЧасти);
			Иначе
				СоставТабличнойЧасти = ГруппировочнаяСтрока.Состав;
			КонецЕсли;
	
			НоваяСтрокаСостава = СоставТабличнойЧасти.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСостава, СтрокиДокумента);
			НоваяСтрокаСостава.КодСтроки = СтрокиДокумента.НомерСтроки;
			НоваяСтрокаСостава.НФАНаименование = СтрокиДокумента.ДенежныйДокументНаименование;
			Если ЗначениеЗаполнено(СтрокиДокумента.Серия) Или ЗначениеЗаполнено(СтрокиДокумента.Номер) Тогда
				СерияНомер = СокрЛП(СтрокиДокумента.Серия);
				Если ЗначениеЗаполнено(СтрокиДокумента.Номер) Тогда
					СерияНомер = СерияНомер + ?(ЗначениеЗаполнено(СерияНомер), " ", "") + СтрокиДокумента.Номер;
				КонецЕсли; 
				НоваяСтрокаСостава.НФАНаименование = НоваяСтрокаСостава.НФАНаименование + " (" + СерияНомер + ")"; 
			КонецЕсли; 
			ОтборСтрокиДокумента = Новый Структура("НомерСтрокиДокумента", СтрокиДокумента.НомерСтроки);
			СтрокиДвижений = ТаблицаДвиженийДокументаЗаб.НайтиСтроки(ОтборСтрокиДокумента);
			Если СтрокиДвижений.Количество() > 0 Тогда
				СтрокаСебестоимости = СтрокиДвижений[0];
				НоваяСтрокаСостава.Сумма = СтрокаСебестоимости.СуммаОстаток;
				Если СтрокаСебестоимости.КоличествоОстаток <> 0 Тогда
					НоваяСтрокаСостава.Цена = СтрокаСебестоимости.СуммаОстаток / СтрокаСебестоимости.КоличествоОстаток;
				КонецЕсли;
				СтрокаСебестоимости.КоличествоОстаток = СтрокаСебестоимости.КоличествоОстаток - НоваяСтрокаСостава.Количество;
				СтрокаСебестоимости.СуммаОстаток = СтрокаСебестоимости.СуммаОстаток - НоваяСтрокаСостава.Сумма;
			Иначе
				Если НоваяСтрокаСостава.Цена = 0 И НоваяСтрокаСостава.Количество <> 0 Тогда
					НоваяСтрокаСостава.Цена = НоваяСтрокаСостава.Сумма / НоваяСтрокаСостава.Количество;
				КонецЕсли;
			КонецЕсли;
			НоваяСтрокаСостава.Всего = НоваяСтрокаСостава.Сумма;
			Всего = Всего + НоваяСтрокаСостава.Всего;
		КонецЦикла;
		
		СтрокаШапки.Всего = Всего;
		
		ДанныеТабличныхЧастейДокумента = Новый Массив;
		ИспользуемыеГруппы.Сортировать("ПорядокСчета");
		Для Каждого ИспользуемаяГруппа Из ИспользуемыеГруппы Цикл
			СтрокиГруппы = СтрокиНФАПоГруппам.Получить(ИспользуемаяГруппа.Группа);
			ДанныеТабличныхЧастейДокумента.Добавить(СтрокиГруппы);
		КонецЦикла;
		СтрокаШапки.СоставДокумента = ДанныеТабличныхЧастейДокумента;
		
	КонецЦикла;
	
КонецПроцедуры

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаШапкиДляПечатиНакладной0510458()
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыбытиеНеоплаченныхПутевок.Ссылка,
	|	ВыбытиеНеоплаченныхПутевок.Номер КАК Номер,
	|	ВыбытиеНеоплаченныхПутевок.Дата КАК Дата,
	|	ВыбытиеНеоплаченныхПутевок.Организация,
	|	ВыбытиеНеоплаченныхПутевок.ИФО,
	|	ВыбытиеНеоплаченныхПутевок.Подразделение.Наименование КАК НаименованиеОтправитель,
	|	ВыбытиеНеоплаченныхПутевок.ЦМО.Сотрудник КАК СотрудникОтправитель,
	|	ВЫБОР
	|		КОГДА ВыбытиеНеоплаченныхПутевок.Контрагент.НаименованиеСокращенное = """"
	|			ТОГДА ВЫБОР
	|					КОГДА ВыбытиеНеоплаченныхПутевок.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|							И НЕ ВыбытиеНеоплаченныхПутевок.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное = """"
	|						ТОГДА ВыбытиеНеоплаченныхПутевок.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное
	|					ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ВыбытиеНеоплаченныхПутевок.Контрагент)
	|				КОНЕЦ
	|		ИНАЧЕ ВыбытиеНеоплаченныхПутевок.Контрагент.НаименованиеСокращенное
	|	КОНЕЦ КАК НаименованиеПолучатель,
	|	ВЫБОР
	|		КОГДА ВыбытиеНеоплаченныхПутевок.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА ВЫРАЗИТЬ(ВыбытиеНеоплаченныхПутевок.Контрагент.ЮридическоеФизическоеЛицо КАК Справочник.ЮридическиеЛица).КодОКПО
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ОКПОПолучатель,
	|	ВЫБОР
	|		КОГДА ВыбытиеНеоплаченныхПутевок.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА ВЫРАЗИТЬ(ВыбытиеНеоплаченныхПутевок.Контрагент.ЮридическоеФизическоеЛицо КАК Справочник.ЮридическиеЛица).КодПоРПБС
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодРПБСПолучателя,
	|	ВыбытиеНеоплаченныхПутевок.Контрагент.ИНН КАК ИННПолучатель,
	|	ВыбытиеНеоплаченныхПутевок.Контрагент.КПП КАК КПППолучатель,
	|	ВЫБОР
	|		КОГДА ИсторияКППКонтрагент.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьИзменениеКПППолучатель,
	|	ВЫБОР
	|		КОГДА ВыбытиеНеоплаченныхПутевок.Перевозчик.НаименованиеСокращенное = """"
	|			ТОГДА ВЫБОР
	|					КОГДА ВыбытиеНеоплаченныхПутевок.Перевозчик.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|							И НЕ ВыбытиеНеоплаченныхПутевок.Перевозчик.ЮридическоеФизическоеЛицо.НаименованиеПолное = """"
	|						ТОГДА ВыбытиеНеоплаченныхПутевок.Перевозчик.ЮридическоеФизическоеЛицо.НаименованиеПолное
	|					ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ВыбытиеНеоплаченныхПутевок.Перевозчик)
	|				КОНЕЦ
	|		ИНАЧЕ ВыбытиеНеоплаченныхПутевок.Перевозчик.НаименованиеСокращенное
	|	КОНЕЦ КАК НаименованиеПеревозчик,
	|	ВЫБОР
	|		КОГДА ВыбытиеНеоплаченныхПутевок.Перевозчик.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА ВыбытиеНеоплаченныхПутевок.Перевозчик.ЮридическоеФизическоеЛицо.КодОКПО
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ОКПОПеревозчик,
	|	ВыбытиеНеоплаченныхПутевок.Перевозчик.ИНН КАК ИННПеревозчик,
	|	ВыбытиеНеоплаченныхПутевок.Перевозчик.КПП КАК КПППеревозчик,
	|	ВЫБОР
	|		КОГДА ИсторияКПППеревозчик.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьИзменениеКПППеревозчик,
	|	ВыбытиеНеоплаченныхПутевок.ОснованиеДляАкта КАК ДокументОснование,
	|	ВыбытиеНеоплаченныхПутевок.НомерОснованияДляАкта КАК ДокументОснованиеНомер,
	|	ВыбытиеНеоплаченныхПутевок.ДатаОснованияДляАкта КАК ДокументОснованиеДата,
	|	ВыбытиеНеоплаченныхПутевок.ДоверенностьВидДокумента КАК Доверенность,
	|	ВыбытиеНеоплаченныхПутевок.ДатаДоверенности КАК ДоверенностьДата,
	|	ВыбытиеНеоплаченныхПутевок.НомерДоверенности КАК ДоверенностьНомер,
	|	ВыбытиеНеоплаченныхПутевок.ОтветственныйИсполнитель,
	|	ВыбытиеНеоплаченныхПутевок.Руководитель КАК УполномоченноеЛицо
	|ИЗ
	|	Документ.ВыбытиеНеоплаченныхПутевок КАК ВыбытиеНеоплаченныхПутевок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КППИстория КАК ИсторияКППКонтрагент
	|		ПО ВыбытиеНеоплаченныхПутевок.Контрагент = ИсторияКППКонтрагент.Ссылка
	|			И (ИсторияКППКонтрагент.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КППИстория КАК ИсторияКПППеревозчик
	|		ПО ВыбытиеНеоплаченныхПутевок.Перевозчик = ИсторияКПППеревозчик.Ссылка
	|			И (ИсторияКПППеревозчик.НомерСтроки = 1)
	|ГДЕ
	|	ВыбытиеНеоплаченныхПутевок.Ссылка В (&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Номер";
	
КонецФункции

Функция ТекстЗапросаТаблицыМатериалыДляПечатиНакладной0510458()
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыбытиеНеоплаченныхПутевокМатериалы.Ссылка КАК Ссылка,
	|	ВыбытиеНеоплаченныхПутевокМатериалы.ВидДенежногоДокумента КАК ВидДенежногоДокумента,
	|	ВыбытиеНеоплаченныхПутевокМатериалы.ВидДенежногоДокумента.Наименование КАК ВидДенежногоДокументаНаименование,
	|	ВыбытиеНеоплаченныхПутевокМатериалы.ДенежныйДокумент КАК ДенежныйДокумент,
	|	ВыбытиеНеоплаченныхПутевокМатериалы.ДенежныйДокумент.Наименование КАК ДенежныйДокументНаименование,
	|	ВыбытиеНеоплаченныхПутевокМатериалы.ВидДенежногоДокумента.ОКП КАК КодТовара,
	|	ВыбытиеНеоплаченныхПутевокМатериалы.ДенежныйДокумент.ЕдиницаИзмерения.Код КАК ЕдИзмКод,
	|	ВыбытиеНеоплаченныхПутевокМатериалы.ДенежныйДокумент.ЕдиницаИзмерения.Наименование КАК ЕдИзмНаименование,
	|	ВыбытиеНеоплаченныхПутевокМатериалы.Количество КАК Количество,
	|	0 КАК Цена,
	|	0 КАК Сумма,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС) КАК СтавкаНДС,
	|	0 КАК СуммаНДС,
	|	0 КАК Всего,
	|	ВыбытиеНеоплаченныхПутевок.СчетУчета КАК СчетУчета,
	|	ВыбытиеНеоплаченныхПутевок.КФО КАК КФО,
	|	ВыбытиеНеоплаченныхПутевокМатериалы.НомерСтроки КАК НомерСтроки,
	|	ВыбытиеНеоплаченныхПутевокМатериалы.ДенежныйДокумент.Серия КАК Серия,
	|	ВыбытиеНеоплаченныхПутевокМатериалы.ДенежныйДокумент.Номер КАК Номер
	|ИЗ
	|	Документ.ВыбытиеНеоплаченныхПутевок.Материалы КАК ВыбытиеНеоплаченныхПутевокМатериалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыбытиеНеоплаченныхПутевок КАК ВыбытиеНеоплаченныхПутевок
	|		ПО ВыбытиеНеоплаченныхПутевокМатериалы.Ссылка = ВыбытиеНеоплаченныхПутевок.Ссылка
	|ГДЕ
	|	ВыбытиеНеоплаченныхПутевокМатериалы.Ссылка В (&МассивОбъектов)
	|	И ВыбытиеНеоплаченныхПутевок.Ссылка В (&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|ИТОГИ
	|ПО
	|	Ссылка";

КонецФункции

Функция ТекстЗапросаДвиженияЗабалансДляПечатиНакладнойНаОтпуск0510458()
	Возврат
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор КАК Документ.ВыбытиеНеоплаченныхПутевок) КАК Ссылка,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт КАК СчетУчета,
	|	ВЫБОР
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ВидыДенежныхДокументов)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК Справочник.ВидыДенежныхДокументов)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ВидыДенежныхДокументов)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 КАК Справочник.ВидыДенежныхДокументов)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ВидыДенежныхДокументов)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3 КАК Справочник.ВидыДенежныхДокументов)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДенежныхДокументов.ПустаяСсылка)
	|	КОНЕЦ КАК НоменклатураСсылка,
	|	ВЫБОР
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ДенежныеДокументы)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК Справочник.ДенежныеДокументы)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ДенежныеДокументы)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 КАК Справочник.ДенежныеДокументы)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ДенежныеДокументы)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3 КАК Справочник.ДенежныеДокументы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДенежныеДокументы.ПустаяСсылка)
	|	КОНЕЦ КАК ДопСубконто,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоКт КАК Количество,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Сумма КАК Сумма,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоКт КАК КоличествоОстаток,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Сумма КАК СуммаОстаток,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)) КАК КПССсылка,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.КЭККт, ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка)) КАК КЭКСсылка,
	|	0 КАК НомерСтрокиДокумента
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	|			,
	|			,
	|			Регистратор В (&МассивОбъектов)
	|				И (ВидСубконтоКт1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ВидыДенежныхДокументов)
	|					ИЛИ ВидСубконтоКт2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ВидыДенежныхДокументов)
	|					ИЛИ ВидСубконтоКт3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ВидыДенежныхДокументов)),
	|			,
	|			) КАК ЖурналПроводокЕПСБУДвиженияССубконто
	|ГДЕ
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоКт > 0";
	
КонецФункции

Функция ПечатьНакладной0315007(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_НакладнаяМ15";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_Накладная0315007");
	
	ОбластьМакетаШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакетаСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьМакетаИтого  = Макет.ПолучитьОбласть("Итого");
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор КАК Документ.ВыбытиеНеоплаченныхПутевок) КАК Ссылка,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт КАК СчетУчета,
		|	ВЫБОР
		|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ДенежныеДокументы)
		|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК Справочник.ДенежныеДокументы)
		|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ДенежныеДокументы)
		|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 КАК Справочник.ДенежныеДокументы)
		|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ДенежныеДокументы)
		|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3 КАК Справочник.ДенежныеДокументы)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДенежныеДокументы.ПустаяСсылка)
		|	КОНЕЦ КАК ДенежныйДокумент,
		|	СУММА(ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоКт) КАК Количество,
		|	СУММА(ЖурналПроводокЕПСБУДвиженияССубконто.Сумма) КАК Сумма,
		|	СУММА(ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоКт) КАК КоличествоОстаток,
		|	СУММА(ЖурналПроводокЕПСБУДвиженияССубконто.Сумма) КАК СуммаОстаток
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
		|			,
		|			,
		|			Регистратор В (&МассивОбъектов)
		|				И (ВидСубконтоКт1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ДенежныеДокументы)
		|					ИЛИ ВидСубконтоКт2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ДенежныеДокументы)
		|					ИЛИ ВидСубконтоКт3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ДенежныеДокументы)),
		|			,
		|			) КАК ЖурналПроводокЕПСБУДвиженияССубконто
		|
		|СГРУППИРОВАТЬ ПО
		|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт,
		|	ВЫБОР
		|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ДенежныеДокументы)
		|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК Справочник.ДенежныеДокументы)
		|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ДенежныеДокументы)
		|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 КАК Справочник.ДенежныеДокументы)
		|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ДенежныеДокументы)
		|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3 КАК Справочник.ДенежныеДокументы)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДенежныеДокументы.ПустаяСсылка)
		|	КОНЕЦ,
		|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор КАК Документ.ВыбытиеНеоплаченныхПутевок)";
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписаниеПутевок.Номер КАК пНомер,
	|	СписаниеПутевок.Ссылка КАК Ссылка,
	|	СписаниеПутевок.Дата КАК пДата,
	|	СписаниеПутевок.Организация,
	|	СписаниеПутевок.Организация.НаименованиеПолное КАК пНаименованиеОрганизации,
	|	СписаниеПутевок.Организация.КодОКПО КАК пКодОКПО,
	|	СписаниеПутевок.Подразделение,
	|	СписаниеПутевок.Подразделение.Представление КАК пПодразделениеОтправитель,
	|	СписаниеПутевок.ЦМО.Сотрудник,
	|	СписаниеПутевок.Контрагент.Представление КАК пКонтрагент,
	|	СписаниеПутевок.Договор.Представление КАК пДоговор,
	|	СписаниеПутевок.КФО КАК КФО,
	|	СписаниеПутевок.СчетУчета КАК СчетУчета,
	|	СписаниеПутевокМатериалы.ДенежныйДокумент,
	|	СписаниеПутевокМатериалы.ДенежныйДокумент.Представление КАК пНоменклатура,
	|	СписаниеПутевокМатериалы.ДенежныйДокумент.Наименование КАК НоменклатураНаименование,
	|	СписаниеПутевокМатериалы.ДенежныйДокумент.Наименование КАК НоменклатураНаименованиеПолное,
	|	СписаниеПутевокМатериалы.ДенежныйДокумент.Код КАК пКодАналитики,
	|	"""" КАК пНоменклатурныйНомер,
	|	ЕСТЬNULL(СписаниеПутевокМатериалы.Количество, 0) КАК пКоличество,
	|	СписаниеПутевокМатериалы.ДенежныйДокумент.ЕдиницаИзмерения.Код КАК пКодЕдиницы,
	|	СписаниеПутевокМатериалы.ДенежныйДокумент.ЕдиницаИзмерения.Наименование КАК пЕдиница,
	|	0 КАК пСуммаБезНДС,
	|	0 КАК пСуммаНДС,
	|	0 КАК пВсего
	|ИЗ
	|	Документ.ВыбытиеНеоплаченныхПутевок КАК СписаниеПутевок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыбытиеНеоплаченныхПутевок.Материалы КАК СписаниеПутевокМатериалы
	|		ПО СписаниеПутевок.Ссылка = СписаниеПутевокМатериалы.Ссылка
	|ГДЕ
	|	СписаниеПутевок.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	пДата,
	|	пНомер,
	|	СписаниеПутевокМатериалы.НомерСтроки
	|ИТОГИ ПО
	|	Ссылка";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	ПервыйДокумент = Истина;
	
	ВыборкаШапка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаШапка.Следующий() Цикл
	
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
    	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	
		ОбластьМакетаШапка.Параметры.Заполнить(ВыборкаШапка);
		РегистрыСведений.НастройкиПечатиПрефиксаНомера.УстановитьНомерДляПечатиВОбластьПечати(ОбластьМакетаШапка,"пНомер",ВыборкаШапка.пНомер,ВыборкаШапка.Ссылка,Неопределено, Истина);
		ТабличныйДокумент.Вывести(ОбластьМакетаШапка);
		
		КоличествоИтого = 0;
		СуммаБезНДСИтого = 0;
		СуммаНДСИтого = 0;
		ВсегоИтого = 0;
		
		ВыборкаСтроки = ВыборкаШапка.Выбрать();
		Пока ВыборкаСтроки.Следующий() Цикл
		
			ОбластьМакетаСтрока.Параметры.Заполнить(ВыборкаСтроки);
			пКорСчет = "" + ВыборкаШапка.КФО;
			пКорСчет = пКорСчет + ?(ПустаяСтрока(пКорСчет), "", ".") + ВыборкаШапка.СчетУчета;
			ОбластьМакетаСтрока.Параметры.Заполнить(Новый Структура("пСчетКредита", пКорСчет));
			
			СтруктураПараметров = Новый Структура("пКоличество, пСуммаБезНДС, пСуммаНДС, пВсего, пЦена", 0, 0, 0, 0, 0);
		
				
			Отбор = Новый Структура("Ссылка, СчетУчета, ДенежныйДокумент");
			ЗаполнитьЗначенияСвойств(Отбор, ВыборкаСтроки);
			СтрокиДвижений = ТаблицаДвижений.НайтиСтроки(Отбор);
			Если СтрокиДвижений.Количество() > 0 Тогда
				
				СтрокаСебестоимости = СтрокиДвижений[0];
				СтруктураПараметров.пКоличество = ВыборкаСтроки.пКоличество;
				Если ВыборкаСтроки.пКоличество = СтрокаСебестоимости.КоличествоОстаток Тогда
					СтруктураПараметров.пВсего = СтрокаСебестоимости.СуммаОстаток;
					СтруктураПараметров.пЦена = ?(СтруктураПараметров.пКоличество = 0, 0, СтрокаСебестоимости.СуммаОстаток / СтрокаСебестоимости.КоличествоОстаток);
				ИначеЕсли СтрокаСебестоимости.КоличествоОстаток > 0 Тогда
					СтруктураПараметров.пЦена = Окр(СтрокаСебестоимости.СуммаОстаток / СтрокаСебестоимости.КоличествоОстаток, 2);
					СтруктураПараметров.пВсего = СтруктураПараметров.пЦена * СтруктураПараметров.пКоличество;
				КонецЕсли;
				СтруктураПараметров.пСуммаБезНДС = СтруктураПараметров.пВсего;
				СтрокаСебестоимости.КоличествоОстаток = СтрокаСебестоимости.КоличествоОстаток - СтруктураПараметров.пКоличество;
				СтрокаСебестоимости.СуммаОстаток = СтрокаСебестоимости.СуммаОстаток - СтруктураПараметров.пВсего;
					
			КонецЕсли;
			
			ОбластьМакетаСтрока.Параметры.Заполнить(СтруктураПараметров);
			
			ТабличныйДокумент.Вывести(ОбластьМакетаСтрока);
			
			КоличествоИтого		= КоличествоИтого 	+ СтруктураПараметров.пКоличество;
			СуммаБезНДСИтого	= СуммаБезНДСИтого	+ СтруктураПараметров.пСуммаБезНДС;
			СуммаНДСИтого		= СуммаНДСИтого		+ СтруктураПараметров.пСуммаНДС;
			ВсегоИтого			= ВсегоИтого		+ СтруктураПараметров.пВсего;
			
		
		КонецЦикла; 
	    СтруктураОбластьМакетаИтого = Новый Структура("пКоличествоИтого,пСуммаБезНДСИтого,пСуммаНДСИтого,пВсегоИтого");
		СтруктураОбластьМакетаИтого.пКоличествоИтого	= КоличествоИтого;
		СтруктураОбластьМакетаИтого.пСуммаБезНДСИтого	= СуммаБезНДСИтого;
		СтруктураОбластьМакетаИтого.пСуммаНДСИтого		= СуммаНДСИтого;
		СтруктураОбластьМакетаИтого.пВсегоИтого		= ВсегоИтого;
		ОбластьМакетаИтого.Параметры.Заполнить(СтруктураОбластьМакетаИтого);
		
		ТабличныйДокумент.Вывести(ОбластьМакетаИтого);
		
		СтруктураОбластьМакетаПодвал = Новый Структура("пКоличествоНаименованийПрописью,пВсегоИтогоПрописью,пСуммаНалогов,пДолжностьРуководитель,пФИОРуководитель,пФИОБухгалтер");
		СтруктураОбластьМакетаПодвал.пКоличествоНаименованийПрописью = ЧислоПрописью(ВыборкаСтроки.Количество(),,"наименование,наименования,наименований,с,,,,,0");
		
		СтруктураОбластьМакетаПодвал.пВсегоИтогоПрописью = ОбщегоНазначенияБГУ.СформироватьСуммуПрописью(ВсегоИтого,Константы.ВалютаРегламентированногоУчета.Получить());
		СтруктураОбластьМакетаПодвал.пСуммаНалогов = "в том числе сумма НДС: " 
														+ ОбщегоНазначенияБГУ.СформироватьСуммуПрописью(СуммаНДСИтого,Константы.ВалютаРегламентированногоУчета.Получить());
		Руководитель = ОрганизационнаяСтруктураПовтИсп.ОтветственноеЛицоОрганизации(ВыборкаШапка.Организация, 
																					Перечисления.ОтветственныеЛицаОрганизаций.Руководитель,
																					ВыборкаШапка.пДата);
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность", 
											Руководитель.ОтветственноеЛицоСсылка,
											ВыборкаШапка.пДата);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника);
		СтруктураОбластьМакетаПодвал.пДолжностьРуководитель = ДанныеСотрудника.Должность;
		СтруктураОбластьМакетаПодвал.пФИОРуководитель = КорреспондентыКлиентСервер.ФИО(Новый Структура("Фамилия, Имя, Отчество",
																										ДанныеСотрудника.Фамилия,
																										ДанныеСотрудника.Имя,
																										ДанныеСотрудника.Отчество));
		ГлБухгалтер	 = ОрганизационнаяСтруктураПовтИсп.ОтветственноеЛицоОрганизации(ВыборкаШапка.Организация, 
																					Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер,
																					ВыборкаШапка.пДата);
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", 
											ГлБухгалтер.ОтветственноеЛицоСсылка,
											ВыборкаШапка.пДата);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника);
		СтруктураОбластьМакетаПодвал.пФИОБухгалтер	  = КорреспондентыКлиентСервер.ФИО(Новый Структура("Фамилия, Имя, Отчество",
																										ДанныеСотрудника.Фамилия,
																										ДанныеСотрудника.Имя,
																										ДанныеСотрудника.Отчество));
	    ОбластьМакетаПодвал.Параметры.Заполнить(СтруктураОбластьМакетаПодвал);
		ТабличныйДокумент.Вывести(ОбластьМакетаПодвал);
	
	
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		                                               НомерСтрокиНачало, ОбъектыПечати, ВыборкаШапка.Ссылка);
	КонецЦикла;
	
	
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьНакладной0504205(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор КАК Документ.ВыбытиеНеоплаченныхПутевок) КАК Ссылка,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт КАК СчетУчета,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК ВидДенежногоДокументаСсылка,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 КАК ДенежныйДокументСсылка,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоКт КАК Количество,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Сумма КАК Сумма,
	|	СУММА(ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоКт) КАК КоличествоОстаток,
	|	СУММА(ЖурналПроводокЕПСБУДвиженияССубконто.Сумма) КАК СуммаОстаток
	|ПОМЕСТИТЬ Проводки
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	|			,
	|			,
	|			Регистратор В (&МассивОбъектов)
	|				И (ВидСубконтоКт1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ВидыДенежныхДокументов)
	|					И ВидСубконтоКт2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ДенежныеДокументы)),
	|			,
	|			) КАК ЖурналПроводокЕПСБУДвиженияССубконто
	|
	|СГРУППИРОВАТЬ ПО
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт,
	|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор КАК Документ.ВыбытиеНеоплаченныхПутевок),
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Сумма
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписаниеПутевок.Номер КАК Номер,
	|	СписаниеПутевок.Ссылка КАК Ссылка,
	|	СписаниеПутевок.Дата КАК Дата,
	|	СписаниеПутевок.Организация,
	|	ВЫБОР
	|		КОГДА СписаниеПутевок.Организация.НаименованиеПолное = """"
	|			ТОГДА СписаниеПутевок.Организация.Наименование
	|		ИНАЧЕ СписаниеПутевок.Организация.НаименованиеПолное
	|	КОНЕЦ КАК Отправитель,
	|	СписаниеПутевок.Организация.КодОКПО КАК ОКПООтправитель,
	|	СписаниеПутевок.Организация.ИНН КАК ИННОтправитель,
	|	СписаниеПутевок.Подразделение,
	|	ВЫБОР
	|		КОГДА СписаниеПутевок.Подразделение.НаименованиеПолное = """"
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(СписаниеПутевок.Подразделение)
	|		ИНАЧЕ СписаниеПутевок.Подразделение.НаименованиеПолное
	|	КОНЕЦ КАК ПодразделениеОтправитель,
	|	ВЫБОР
	|		КОГДА СписаниеПутевок.Подразделение.ОбособленноеПодразделение
	|			ТОГДА СписаниеПутевок.Подразделение.РегистрацияВНалоговомОргане.КПП
	|		ИНАЧЕ СписаниеПутевок.Организация.КПП
	|	КОНЕЦ КАК КППОтправитель,
	|	ВЫБОР
	|		КОГДА СписаниеПутевок.Контрагент.НаименованиеСокращенное = """"
	|			ТОГДА ВЫБОР
	|					КОГДА СписаниеПутевок.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|							И НЕ СписаниеПутевок.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное = """"
	|						ТОГДА СписаниеПутевок.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное
	|					ИНАЧЕ ПРЕДСТАВЛЕНИЕ(СписаниеПутевок.Контрагент)
	|				КОНЕЦ
	|		ИНАЧЕ СписаниеПутевок.Контрагент.НаименованиеСокращенное
	|	КОНЕЦ КАК Получатель,
	|	ВЫБОР
	|		КОГДА СписаниеПутевок.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА СписаниеПутевок.Контрагент.ЮридическоеФизическоеЛицо.КодОКПО
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ОКПОПолучатель,
	|	СписаниеПутевок.Контрагент.ИНН КАК ИННПолучатель,
	|	СписаниеПутевок.Контрагент.КПП КАК КПППолучатель,
	|	СписаниеПутевок.Договор.Представление КАК Договор,
	|	СписаниеПутевок.ЦМО.Сотрудник КАК Отпустил,
	|	СписаниеПутевок.КФО КАК КФО,
	|	СписаниеПутевок.Ответственный КАК Ответственный,
	|	СписаниеПутевокМатериалы.ДенежныйДокумент.Наименование + "" ("" + СписаниеПутевокМатериалы.ДенежныйДокумент.Серия + "" "" + СписаниеПутевокМатериалы.ДенежныйДокумент.Номер + "")"" КАК Номенклатура,
	|	СписаниеПутевокМатериалы.ДенежныйДокумент.Код КАК НомерПаспорта,
	|	"""" КАК НоменклатурныйНомер,
	|	ВЫРАЗИТЬ(СписаниеПутевокМатериалы.ДенежныйДокумент.ЕдиницаИзмерения КАК Справочник.КлассификаторЕдиницИзмерения).Код КАК ЕдиницаКод,
	|	ВЫРАЗИТЬ(СписаниеПутевокМатериалы.ДенежныйДокумент.ЕдиницаИзмерения КАК Справочник.КлассификаторЕдиницИзмерения).Наименование КАК ЕдиницаНаименование,
	|	ЕСТЬNULL(СписаниеПутевокМатериалы.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(Проводки.Сумма, 0) / ЕСТЬNULL(СписаниеПутевокМатериалы.Количество, 1) КАК Цена,
	|	ЕСТЬNULL(Проводки.Сумма, 0) КАК СуммаБезНДС,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка) КАК СтавкаНДС,
	|	0 КАК СуммаНДС,
	|	ЕСТЬNULL(Проводки.Сумма, 0) КАК СуммаВсего,
	|	"""" КАК СчетДт,
	|	"""" КАК КПСДт,
	|	"""" КАК КЭКДт,
	|	СписаниеПутевок.СчетУчета.Представление КАК СчетКт,
	|	"""" КАК КПСКт,
	|	"""" КАК КЭККт,
	|	СписаниеПутевокМатериалы.НомерСтроки КАК НомерСтроки,
	|	СписаниеПутевокМатериалы.ПричинаСписания КАК Примечание
	|ИЗ
	|	Документ.ВыбытиеНеоплаченныхПутевок КАК СписаниеПутевок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыбытиеНеоплаченныхПутевок.Материалы КАК СписаниеПутевокМатериалы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Проводки КАК Проводки
	|			ПО (Проводки.Ссылка = СписаниеПутевокМатериалы.Ссылка)
	|				И СписаниеПутевокМатериалы.ВидДенежногоДокумента = Проводки.ВидДенежногоДокументаСсылка
	|				И СписаниеПутевокМатериалы.ДенежныйДокумент = Проводки.ДенежныйДокументСсылка
	|				И СписаниеПутевокМатериалы.Количество = Проводки.Количество
	|		ПО СписаниеПутевок.Ссылка = СписаниеПутевокМатериалы.Ссылка
	|ГДЕ
	|	СписаниеПутевок.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Номер,
	|	НомерСтроки
	|ИТОГИ ПО
	|	Ссылка";
	
	Возврат УправлениеПечатьюБГУ.Напечатать0504205(Запрос, ОбъектыПечати, ИмяМакета);
	
КонецФункции

#КонецОбласти

#КонецЕсли
